%% очистка
clc, clear, close all;

%% Общие параметры
% физические параметры
l = 0.225; % расстояние от центра масс до двигателей

g = 9.81; 
m = 0.486 ;                  % масса квадрокоптера
A_x = 0.25;                  % аэродинамический коэффициент вдоль оси 'OX' кг/с
A_y = 0.25;                  % аэродинамический коэффициент вдоль оси 'OY'
A_z = 0.25;                  % аэродинамический коэффициент вдоль оси 'OZ'
kl = 3 * 10^(-6);
b = 1.14 * 10^(-7);
l = 0.225;

a_r = 0.033;                % постоянная вращательного движения
I_x = 4.856 * 10^(-3);      % момент инерции квадрокоптера при его вращении вдоль оси 'OX' 
I_y =  4.856 * 10^(-3);     % момент инерции квадрокоптера при его вращении вдоль оси 'OY' 
I_z =  8.801 * 10^(-3);     % момент инерции квадрокоптера при его вращении вдоль оси 'OZ' 
I_r = 3.38 * 10^(-5);       % инерция ротора двигателя

% -------- Статья + модель из ГИТ
k = 2.980e-6;        
Im = 3.357e-5;              % Inertia moment of the rotor
I_xx = 4.856e-3;            % kg*m^2
I_yy = 4.856e-3;            % kg*m^2
I_zz = 8.801e-3;            % kg*m^2

%% Константы мои
phi_init = deg2rad(10);
theta_init = deg2rad(10);
psi_init = deg2rad(10);
x_init = 0;
y_init = 0;

z_init = 1;
z_d = 0;

phi_d = 0;
theta_d = 0;
psi_d = 0;

K_z_D1 = 2.5; %  
K_z_P1 = 1.5; % 

K_phi_D1 = 1.75;   % 1.75 - англ статья
K_phi_P1 = 6;
K_phi_I1 = 0;

K_theta_D1 = 1.75;
K_theta_P1 = 6;
K_theta_I1 = 0;

K_psi_D1 = 1.75;
K_psi_P1 = 6;
K_psi_I1 = 0;


%% общие константы


%% Константы для модели ГИТ
roll_i = deg2rad(10);   % rad
pitch_i = deg2rad(10);  % rad
yaw_i = deg2rad(10);      % rad
altitude_i = 1;  % meters

roll_d = 0;   % rad
pitch_d = 0;     % rad
yaw_d = 0;     % rad
altitude_d = 0;  % meters


% PD
K_z_D = 2.5; %  
K_z_P = 1.5; % 

K_phi_D = 1.75;  %'OX' 10.4 / 36
K_phi_P = 6; %  'OX' 22 / 80

K_theta_D = 1.75;   %  'OZ' 11.8
K_theta_P = 6;  %  'OZ' 24

K_psi_D = 1.75;   %  'OY' 25
K_psi_P = 6;  %  'OY' 95
